Errand (no API)/app/views/posts/_form.html.erb

      <%= form.label :service , class:"control-label"%>
      <%= form.collection_select :service_id, Service.all, :id, :option , class:"form-control"%>
---
SELECT "services".* FROM "services"

      <%= form.label :category %>
      <%= form.collection_select :category_id, Category.all, :id, :name , class:"form-control"%>
---
SELECT "categories".* FROM "categories"

      <%= form.label :location %>
      <%= form.collection_select :location_id, Location.all, :id, :name , class:"form-control"%>
---
SELECT "locations".* FROM "locations"