heroku/app/controllers/posts_controller.rb

  def index
    if(params[:term])
      @posts = Post.where('lower(title) LIKE ?', "%#{params[:term]}%".downcase)
    else
      @posts = Post.all
---
SELECT "posts".* FROM "posts" WHERE (lower(title) LIKE '%carpool%')
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)
    @post.email = current_user.email
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "email", "created_at", "updated_at", "category_id", "service_id", "location_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "body" = $1, "location_id" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["body", "I go to airport from north Van weekdays at 8am. I don't mind dropping some people off for free on my way. "], ["location_id", 1], ["updated_at", "2019-07-23 06:26:55.161412"], ["id", 3]]