heroku/app/controllers/static_pages_controller.rb

  def home
    @posts = Post.order("created_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC