app/views/posts/_form.html.erb

SELECT "services".* FROM "services"
---
    <%= form.label :service %>
    <%= form.collection_select :service_id, Service.all, :id, :option %>

SELECT "categories".* FROM "categories"
---
    <%= form.label :category %>
    <%= form.collection_select :category_id, Category.all, :id, :name %>

SELECT "locations".* FROM "locations"
---
    <%= form.label :location %>
    <%= form.collection_select :location_id, Location.all, :id, :name %>