app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (title LIKE '%cookie%')
SELECT "posts".* FROM "posts"
---
  def index
    if(params[:term])
      @posts = Post.where('title LIKE ?', "%#{params[:term]}%")
    else
      @posts = Post.all

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "category_id", "service_id", "location_id", "email") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)
    @post.email = current_user.email
    respond_to do |format|
      if @post.save