app/controllers/posts_pages_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    if(params[:term])
      @posts = Post.where('title LIKE ?', "%#{params[:term]}%")
    else
      @posts = Post.all